Autodesk.Revit.DB.Structure.AnalyticalModelColumn.TopExtensionPlaneId
The top extension plane ID option.
Remarks:
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelColumn::isPlaneValidForExtension method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.BaseExtensionPlaneId
The bottom extension plane ID option.
Remarks:
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelColumn::isPlaneValidForExtension method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015